> local_edition(3)
> expect_identical(1, "a")
Error: 1 (`actual`) not identical to "a" (`expected`).

`actual` is a double vector (1)
`expected` is a character vector ('a')

> expect_equal(1, "a")
Error: 1 (`actual`) not equal to "a" (`expected`).

`actual` is a double vector (1)
`expected` is a character vector ('a')

> local_edition(2)
> expect_identical(1, "a")
Error: 1 not identical to "a".
Types not compatible: double is not character

> expect_equal(1, "a")
Error: 1 not equal to "a".
Types not compatible: double is not character

